{
  "basics": {
    "name": "Luca Raponi",
    "title": "Technical Program Manager, PMP",
    "image": "",
    "email": "lucaraponi2@gmail.com",
    "phone": "(412) 699-4592",
    "url": "",
    "summary": "Passionate Technical Program Manager with over 5 years of experience leading highly performant software development programs.",
    "location": "<a href=https://google.com/maps/place/Pittsburgh,+PA,+USA>Pittsburgh, PA, USA</a>"
  },

  "profiles": {
    "LinkedIn": "<a href=https://linkedin.com/in/lraponi>linkedin.com/in/lraponi</a>",
    "GitHub": "<a href=https://github.com/rodeocrazy>github.com/rodeocrazy</a>"
  },

  "work": [
    {
      "name": "Basis Technologies (Formerly Centro Inc.)",
      "position": "Manager, Technical Program Management",
      "url": "",
      "startDate": "2021-09-01",
      "endDate": "2023-12-01",
      "summary": "<ul><li><p>Led a high performing team of 6 associate to senior level technical project managers and scrum masters. Acted as a mentor to support my team in creating performant software development cross-functional teams, while coaching them to become self-organizing and self-motivating.</p></li><li><p>Worked closely with C-Suite and Technology Leadership to improve program processes (including SDLCs and product intake and development processes), identify, and provide proactive responses to risk, and supply detailed project information to monitor and support program goals.</p></li><li><p>Supported day-to-day operations and growth of a software engineering program of 157 contributors.</p></li><li><p>Collaborated with high-value users and customer facing teams to ensure our customers voice is heard and integrated into technology offerings. Collaborated daily with Product Managers and User Researchers, providing mentorship and end-to-end support of the product life cycle (including user interviews during ideation and beta testing).</p></li><li><p>Started internal program and established processes for US federal research and development tax credit, claiming $1.67 million in tax credits.</p></li><li><p>Implemented SPACE framework for developer productivity. Drafted and obtained approval from program and executive leadership on technical KPIs. Created automated Power BI dashboards displaying real -time technology KPIs.</p></li><li><p>Worked closely with a variety of functional groups including: Software Engineering, Big Data Engineering, Data Science, Production Operations, Automated &amp; Manual Quality Assurance, UI Design, UX Research, Product Management, Customer Success, Product Marketing, Legal, and Accounting &amp; Finance.</p></li></ul>"
    },
    {
      "name": "Centro Inc.",
      "position": "Technical Project Manager & Scrum Master",
      "url": "",
      "startDate": "2019-09-01",
      "endDate": "2021-08-01",
      "summary": "<ul><li><p>Collaborated daily with all engineering teams under our Demand-Side Platform (DSP) program to deliver complex and innovative software using agile methodologies.</p></li><li><p>Managed large cross-functional projects and programs such as Disaster Recovery initiatives and Machine Learning Optimization.</p></li><li><p>Acted as a strong team player to support the creation of high performing cross-functional scrum teams engaging frequently with our Data Science and Big Data groups to secure functional expertise.</p></li><li><p>Streamlined Scrum practices and facilitated Scrum ceremonies for 5 agile software development teams resulting in a 27% increase in the predictably of timely project delivery.</p></li><li><p>Managed Atlassian Suite (Bitbucket, JIRA and Confluence) administration, supporting process engineering, establishing new workflows, troubleshooting, automation setup and add-on procurement.</p></li></ul>"
    },
    {
      "name": "Centro Inc.",
      "position": "Associate Project Manager",
      "url": "",
      "startDate": "2018-08-01",
      "endDate": "2019-08-01",
      "summary": "<ul><li><p>Collaborated closely with cross-functional engineering teams to achieve product objectives, resolve development obstacles, address resource issues, and ensure timely project completion.</p></li><li><p>Facilitated Agile ceremonies, supplied Agile coaching services, monitored Sprint performance, and delivered comprehensive project status reports to program leadership to uphold project momentum and alignment with strategic goals.</p></li><li><p>Supplied accurate and transparent delivery updates to customers and executives to support informed decision-making and ensure alignment with project milestones.</p></li></ul>"
    },
    {
      "name": "Centro Inc.",
      "position": "Project Management Intern",
      "url": "",
      "startDate": "2018-06-01",
      "endDate": "2018-08-01",
      "summary": ""
    }
  ],
  "education": [
    {
      "institution": "University of Toronto&nbsp;&nbsp;|&nbsp;&nbsp;Major in Biochemistry & Human Biology",
      "location": "Toronto, ON",
      "url": "",
      "area": "<ul><li><p>Chapter President, Phi Kappa Sigma International Fraternity</p></li><li><p>Senior Analyst, University of Toronto Engineering Finance Association</p></li><li><p>Volunteer Notetaker, UofT Accessibility Services</p></li></ul>",
      "studyType": "Honors Bachelor of Science",
      "startDate": "2014-09-01",
      "endDate": "2018-06-01"
    }
  ],
  "volunteer": [
    {
      "organization": "Computer Reach",
      "location": "Pittsburgh, PA",
      "position": "Volunteer",
      "url": "",
      "startDate": "2024-01-01",
      "endDate": "Present",
      "summary": "Refurbish used electronics for use by low-income households and communities"
    }
  ],

  "certificates": [
    {
      "name": "PMI: Project Management Professional (PMP #2816148)",
      "date": "",
      "issuer": "",
      "url": "",
      "icon": "fa-solid fa-location-dot"
    }
  ],
  "skills": [
    {
      "name": "Project Management Tools",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Atlassian Suite (JIRA, Bitbucket, Confluence)",
        "Asana",
        "Aha!",
        "Microsoft Project"
      ]
    },
    {
      "name": "Programming Languages",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "SQL"
      ]
    },
    {
      "name": "Data Visualization Tools",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "PowerBI",
        "Datadog",
        "Metabase",
        "Tableau"
      ]
    },
    {
      "name": "Microsoft Office",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Advanced in Excel, Sharepoint, Power Automate and associated tools"
      ]
    },
    {
      "name": "Other Tools",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "ChatGPT",
        "Lucidchart",
        "Smartsheet",
        "Workday"
      ]
    }
  ]
}
